# frozen_string_literal: true

@there_star = ["Атлетік Більбао", "Брюге", "Динамо Київ", "Арсенал", "АЗ Алкмар", "Вільяреал", "Боруссия Менхенгладбах",
              "Баєр", "Евертон", "Ліон", "Славія", "Базель", "Динамо Загреб", "Спортінг", "Селтік"]

@four_star = ["Інтер", "Лестер", "Борусія Дортмунд", "Аталанта", "Челсі", "Порту", "Лаціо", "Хетафе", "Севілья",
              "Вулверхемптон", "Рома", "Зальзбург", "Реал Сосьєдат", "Наполі"]

@five_star = ["Ліверпуль", "Манчестер Сіті", "Барселона", "Баварія", "ПСЖ", "АЯКС", "Бенфіка", "Реал Мадрид", 
             "Лейпціг", "Ювентус", "Атлетіко Мадрид", "Шахтер", "Валенсія", "Зеніт", "Манчетер Юнайтед"]
             

# puts @club_random
def random_group
  @club_random = [@there_star.sample, @four_star.sample, @five_star.sample]
end

def random_club
  return random_group.sample
end

puts random_group.to_s
